import type {Locale, Question} from "~/types/quiz"

const questions = [
	{
		questionText: "Когда И. А. Каримов начал свою деятельность в качестве главы Узбекистана?",
		options: ["24.06.1989", "1.09.1991г.д", "23.03.1990г.", "1.01.1992г."],
		correctAnswer: "24.06.1989",
	},
	{
		questionText: "Сколько земли в Узбекистане в 1989г. Засевалось хлопком?",
		options: ["до 80-90 %", "50-60 %", "65-70 %", "75-80 %"],
		correctAnswer: "до 80-90 %",
	},
	{
		questionText: "Уже в 1989 г. в Узбекистане было принято решение выделить под приусадебные участки орошаемых земель?",
		options: ["400 тыс. гектаров", "800 тыс. гектаров", "1,5 млн. гектаров", "200 тыс. гектаров"],
		correctAnswer: "400 тыс. гектаров",
	},
	{
		questionText: "Какая часть населения Узбекистана в конце 1980 гг. имела доход не превышающий 75 рублей в месяц?",
		options: ["45 %", "35 %", "75 %", "около 60 %"],
		correctAnswer: "45 %",
	},
	{
		questionText: "Когда был утвержден пост Президента Узбекской ССР?",
		options: ["24.03.1990г.", "21.10.1989г.", "2.07.1990г.", "29.12.1991г."],
		correctAnswer: "24.03.1990г.",
	},
	{
		questionText: "Какая идея способствовала урегулированию Ферганских событий в 1989г?",
		options: ["Межнационального согласия", "Религиозного согласия", "Роста народного благосостояния", "Социальной солидарности"],
		correctAnswer: "Межнационального согласия",
	},
	{
		questionText: "Участники каких событий хотели превратить Узбекистан в исламское государство?",
		options: ["Наманганских", "Ферганских", "Ромитанских", "Ошских"],
		correctAnswer: "Наманганских",
	},
	{
		questionText: "Когда произошли Наманганские события?",
		options: ["декабрь 1991г", "Май 1989г", "Июнь 1990г", "Декабрь 1992г"],
		correctAnswer: "декабрь 1991г",
	},
	{
		questionText: "Какой известный писатель высоко оценил роль И. А. Каримова в урегулировании Ферганских событий?",
		options: ["Чингиз Айтматов", "Юрий Бондарев", "Гафур Гулям", "Борис Полевой"],
		correctAnswer: "Чингиз Айтматов",
	},
	{
		questionText: "В конце 1980-х годов доход средней семьи в Узбекистане был ниже среднесоюзного уровня:",
		options: ["В два раза", "В три раза", "В 2.5 раза", "В 1.5 раза"],
		correctAnswer: "В два раза",
	},
	{
		questionText: "К числу национальных лидеров относится:",
		options: ["Мустафа Кемаль Ататюрк", "Анвар Садат", "Шадли Бенджедид", "Ричард Никсон"],
		correctAnswer: "Мустафа Кемаль Ататюрк",
	},
	{
		questionText: "Какая проблема в Узбекистане в советский период достигла немыслимых размеров?",
		options: ["Хлопковая монополия", "Усыхание Арала", "Добыча природных ресурсов", "Нехватка питьевой воды"],
		correctAnswer: "Хлопковая монополия",
	},
	{
		questionText: "Когда в Узбекистане были сделаны первые шаги по созданию национальной Армии?",
		options: ["Летом 1990г.", "Весной 1989г.", "Осенью 1991г.", "Летом 1992г."],
		correctAnswer: "Летом 1990г.",
	},
	{
		questionText: "Какой регион Узбекистана особенно страдал от монокультуры хлопка?",
		options: ["Ферганская долина", "Сурхандарьинская область", "Бухарская область", "Республика Каракалпакстан"],
		correctAnswer: "Ферганская долина",
	},
	{
		questionText: "Сколько земли было выделено населению Узбекистана за все годы власти?",
		options: ["300 тысяч гектаров", "100 тысяч гектаров", "200 тысяч гектаров", "500 тысяч гектаров"],
		correctAnswer: "300 тысяч гектаров",
	},
	{
		questionText: "Какая часть сельского населения Узбекистана к концу 1980 годов была обеспечена нормальной питьевой водой?",
		options: ["50%", "40%", "60%", "Лишь 75%"],
		correctAnswer: "50%",
	},
	{
		questionText: "Какая часть сельского населения Узбекистана в конце 1980 годов была обеспечена природным газом?",
		options: ["17%", "Около 30%", "Менее 50%", "Около 10%"],
		correctAnswer: "17%",
	},
	{
		questionText: "К какому периоду относится «хлопковое дело»?",
		options: ["Середина 80 годов", "Начало 80 годов", "Конец 80 годов", "Начало 90 годов"],
		correctAnswer: "Середина 80 годов",
	},
	{
		questionText: "Какая область Узбекистана в конце советского периода особенно страдала от нехватки питьевой воды?",
		options: ["Хорезмская", "Наманганская", "Ферганская", "Сурхандарьинская"],
		correctAnswer: "Хорезмская",
	},
	{
		questionText: "К какой годовщине независимости был создан труд Президента И. А. Каримова «Узбекистан на пороге достижения независимости»?",
		options: ["К 20-той", "К 21-ой", "К 15-ой", "К 21-ой"],
		correctAnswer: "К 20-той",
	},
	{
		questionText: "Первым шагом к достижению правовой независимости был:",
		options: ["«Закон о государственном языке»", "Закон «О земле»", "Декларация «О государственном суверенитете Узбекской ССР»", "Утверждение поста Президента Узбекской ССР"],
		correctAnswer: "«Закон о государственном языке»",
	},

]

export const teacherPresidentWorksQuestions: Record<Locale, Question[]> = {
	en: questions,
	ru: questions,
	uz: [
		{
			questionText: "И. А. Каримов Узбекистонда рахбарлик фаолиятини качондан бошлаган?",
			options: ["24.06.1989", "1.09.1991 й.", "23.03.1990 й.", "1.01.1992 й."],
			correctAnswer: "24.06.1989",
		},
		{
			questionText: "1989 йилда Узбекистонда неча гектар ерга пахта экилган?",
			options: ["80-90 % гача", "50-60 %", "65-70 %", "75-80 %"],
			correctAnswer: "80-90 % гача",
		},
		{
			questionText: "1989 й. Узбекистонда сугориладиган ерларнинг канча кисмини томорка учун беришга рухсат этилган?",
			options: ["400 минг гектар", "800 минг гектар", "1,5 млн гектар", "200 минг гектар"],
			correctAnswer: "400 минг гектар",
		},
		{
			questionText: "Узбекистонда 1980 йил охирларида ахолининг неча фоизининг даромади бир ойда 75 сумдан ошмаган?",
			options: ["45 %", "35 %", "75 %", "60 % атрофида"],
			correctAnswer: "45 %",
		},
		{
			questionText: "УзССР Президенти лавозими качон тастикланган?",
			options: ["24.03.1990 й.", "21.10.1989 й.", "2.07.1990 й.", "29.12.1991 й."],
			correctAnswer: "24.03.1990 й.",
		},
		{
			questionText: "1989 йилдаги Фаргона вокеаларини тартибга солишга кандай гоя сабаб булди?",
			options: ["Миллатлараро келишув", "Диний келишув", "Халк фаровонлигининг ортиши", "Ижтимоий бирдамлик"],
			correctAnswer: "Миллатлараро келишув",
		},
		{
			questionText: "Кайси вокеаларни катнашчилари Узбекистонни ислом давлатига айлантиришни хохладилар?",
			options: ["Наманган", "Фаргона", "Ромитан", "Ош"],
			correctAnswer: "Наманган",
		},
		{
			questionText: "Наманган вокеалари качон содир булди?",
			options: ["1991 й., декабрь", "1989 й., Май", "1990 й., Июнь", "1992 й., Декабрь"],
			correctAnswer: "1991 й., декабрь",
		},
		{
			questionText: "Кайси таникли ёзувчи И.А. Каримовни Фаргона вокеаларини хал этишдаги ролини юкори бахолади?",
			options: ["Чингиз Айтматов", "Юрий Бондарев", "Гафур Гулям", "Борис Полевой"],
			correctAnswer: "Чингиз Айтматов",
		},
		{
			questionText: "Узбекистонда 1980-йилларда уртача оила бюджети уртача иттифок даражасидан неча марта паст эди?",
			options: ["2 марта", "3 марта", "2.5 марта", "1.5 марта"],
			correctAnswer: "2 марта",
		},
		{
			questionText: "Миллий етакчилар …. сафига киради:",
			options: ["Мустафа Кемаль Ататюрк", "Анвар Садат", "Шадли Бенджедид", "Ричард Никсон"],
			correctAnswer: "Мустафа Кемаль Ататюрк",
		},
		{
			questionText: "Совет даврида Узбекистонда кайси муаммо кутулмаган даражага кутарилди?",
			options: ["Пахта монополияси", "Орол денгизини куриши", "Табиий казилмаларни казиб олиш", "Сув танкислиги"],
			correctAnswer: "Пахта монополияси",
		},
		{
			questionText: "Узбекистонда миллий армияни ташкил этиш буйича биринчи кадам качон куйилди?",
			options: ["1990 й. ёзда", "1989 й. бахорда", "1991 й. кузда", "1992 й. ёзда"],
			correctAnswer: "1990 й. ёзда",
		},
		{
			questionText: "Узбекистоннинг кайси минтакаси факат пахта экилишидан купрок зарар курди?",
			options: ["Фаргона водийси", "Сурхардарё вилояти", "Бухоро вилояти", "Каракалпагистон Республикаси"],
			correctAnswer: "Фаргона водийси",
		},
		{
			questionText: "Совет йиллари хукумронлигида Узбекистан ахолисига канча ер ажратилган?",
			options: ["300 минг гектар", "100 минг гектар", "200 минг гектар", "500 минг гектар"],
			correctAnswer: "300 минг гектар",
		},
		{
			questionText: "Узбекистон кишлок ахолисининг канча кисми 1980 йил охирларида ичимлик суви билан таьминланган?",
			options: ["50%", "40%", "60%", "75%"],
			correctAnswer: "50%",
		},
		{
			questionText: "Узбекистон кишлок ахолисининг канча кисми 1980 йил охирларида табиий газ билан таьминланган?",
			options: ["17%", "30%гача", "50%дан кам", "10% гача"],
			correctAnswer: "17%",
		},
		{
			questionText: "«Пахта иши» кайси даврга тугри келади?",
			options: ["80 йиллар уртаси", "80 йиллар боши", "80 йиллар охири", "90 йиллар боши"],
			correctAnswer: "80 йиллар уртаси",
		},
		{
			questionText: "Узбекистоннинг кайси вилояти совет даврида ичимлик сувининг танкислигидан азият чекан?",
			options: ["Хоразм", "Наманган", "Фаргона", "Сурхондарё"],
			correctAnswer: "Хоразм",
		},
		{
			questionText: "Мустакилликнинг нечанчи йиллигига Президент И.А. Каримовнинг «Узбекистон мустакиллик бусагасида» асари яратилган?",
			options: ["20 й", "21 й", "15 й", "21 й"],
			correctAnswer: "20 й",
		},
		{
			questionText: "Хукукий мустакилликка эришишнинг биринчи кадами нима эди?",
			options: ["Давлат тили хакидаги конун", "Ер хакидаги конун", "Узбекистон ССР нинг суверен давлат хакидаги Декларацияси", "Узбекистон ССР Президенти лавозиимининг тасдикланиши"],
			correctAnswer: "Давлат тили хакидаги конун",
		},

	],
}
